---
kind: method
id: M:Autodesk.Revit.DB.RevolvedSurface.GetProfileCurveInWorldCoordinates
source: html/fd977456-eb4a-caf2-1d09-dedc8e1a4317.htm
---
# Autodesk.Revit.DB.RevolvedSurface.GetProfileCurveInWorldCoordinates Method

Returns a copy of the profile curve expressed in the world coordinate system.

## Syntax (C#)
```csharp
public Curve GetProfileCurveInWorldCoordinates()
```

## Returns
A copy of the profile curve in the world coordinate system.